import STATUS from './status';

// 社区数据
const COMMUNITY = [
  {
    name: '西坝河东里',
    price: '69418',
    age: '80年代',
    textPosition: [116.445257, 39.965577],
    status: STATUS.NOT_OK,
    polygon: [
      [116.443408, 39.968498],
      [116.447062, 39.968995],
      [116.447314, 39.967626],
      [116.448776, 39.966736],
      [116.450911, 39.966555],
      [116.446984, 39.962962],
      [116.441308, 39.966662],
    ],
  },
  {
    name: '西坝河西里',
    price: '67665',
    age: '80年代',
    textPosition: [116.437359, 39.966486],
    status: STATUS.NOT_OK,
    polygon: [
      [116.436081, 39.969114],
      [116.440115, 39.966713],
      [116.436081, 39.963128],
    ],
  },
  {
    name: '西坝河中里',
    price: '68210',
    age: '80年代',
    textPosition: [116.441016, 39.964263],
    status: STATUS.NOT_OK,
    polygon: [
      [116.440883, 39.966359],
      [116.443362, 39.964731],
      [116.439617, 39.961375],
      [116.437144, 39.963],
    ],
  },
  {
    name: '光熙门北里',
    price: '70699',
    age: '90年代',
    textPosition: [116.434815, 39.966861],
    status: STATUS.WAITING,
    polygon: [
      [116.433774, 39.969291],
      [116.435711, 39.96925],
      [116.435807, 39.962466],
      [116.434026, 39.962318],
    ],
  },
];

export default COMMUNITY;